lhzloveyyj/FOC/stm32f103_FOC/电流环/.pack/Keil/STM32F1xx_DFP.2.3.0/RTE_Driver/USBD_STM32F10x.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2017 ARM Ltd.
 *
 * This software is provided 'as-is', without any express or implied warranty.
 * In no event will the authors be held liable for any damages arising from
 * the use of this software. Permission is granted to anyone to use this
 * software for any purpose, including commercial applications, and to alter
 * it and redistribute it freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software in
 *    a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 *
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 *
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *
 * $Date:        19. September 2017
 * $Revision:    V2.1
 *
 * Driver:       Driver_USBD0
 * Configured:   via RTE_Device.h configuration file 
 * Project:      USB Full/Low-Speed Device Driver for ST STM32F10x
 * ---------------------------------------------------------------------- 
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 * 
 *   Configuration Setting                Value
 *   ---------------------                -----
 *   Connect to hardware via Driver_USBD# = 0
 * -------------------------------------------------------------------- */

/* History:
 *  Version 2.1
 *    Added support for CMSIS-RTOS2
 *  Version 2.0
 *    Updated to CMSIS Driver API V2.01
 *  Version 1.00
 *    Initial release
 */

#include <stdint.h>
#include <string.h>

#include "RTE_Components.h"

#if       defined(RTE_CMSIS_RTOS2)
#include "cmsis_os2.h"
#elif     defined(RTE_CMSIS_RTOS)
#include "cmsis_os.h"
#endif

#include "stm32f10x.h"

#include "GPIO_STM32F10x.h"
#include "USBD_STM32F10x.h"

#include "Driver_USBD.h"

#include "RTE_Device.h"
#include "RTE_Components.h"

// Do basic RTE configuration check
#if    (RTE_USB_DEVICE == 0)
#error  Enable USB Device in RTE_Device.h!
#endif

#ifndef USBD_MAX_ENDPOINT_NUM
#define USBD_MAX_ENDPOINT_NUM           8U
#endif
#if    (USBD_MAX_ENDPOINT_NUM > 8)
#error  Too many Endpoints, maximum IN/OUT Endpoint pairs that this driver supports is 8 !!!
#endif

// Endpoint buffer address

// Endpoint buffer sizes in bytes 
// (total available memory for Endpoint buffers is 512 Bytes - EP_BUF_ADDR)
#ifndef USB_EP0_RX_BUF_SIZE
#define USB_EP0_RX_BUF_SIZE     8U
#endif
#define USB_EP0_RX_BUF_OFFSET   0x80U

#ifndef USB_EP0_TX_BUF_SIZE
#define USB_EP0_TX_BUF_SIZE     8U
#endif
#define USB_EP0_TX_BUF_OFFSET   USB_EP0_RX_BUF_OFFSET + USB_EP0_RX_BUF_SIZE

#ifndef USB_EP1_RX_BUF_SIZE
#define USB_EP1_RX_BUF_SIZE     64U
#endif
#define USB_EP1_RX_BUF_OFFSET   USB_EP0_TX_BUF_OFFSET + USB_EP0_TX_BUF_SIZE

#ifndef USB_EP1_TX_BUF_SIZE
#define USB_EP1_TX_BUF_SIZE     64U
#endif
#define USB_EP1_TX_BUF_OFFSET   USB_EP1_RX_BUF_OFFSET + USB_EP1_RX_BUF_SIZE

#ifndef USB_EP2_RX_BUF_SIZE
#define USB_EP2_RX_BUF_SIZE     64U
#endif
#define USB_EP2_RX_BUF_OFFSET   USB_EP1_TX_BUF_OFFSET + USB_EP1_TX_BUF_SIZE

#ifndef USB_EP2_TX_BUF_SIZE
#define USB_EP2_TX_BUF_SIZE     64U
#endif
#define USB_EP2_TX_BUF_OFFSET   USB_EP2_RX_BUF_OFFSET + USB_EP2_RX_BUF_SIZE

#ifndef USB_EP3_RX_BUF_SIZE
#define USB_EP3_RX_BUF_SIZE     8U
#endif
#define USB_EP3_RX_BUF_OFFSET   USB_EP2_TX_BUF_OFFSET + USB_EP2_TX_BUF_SIZE

#ifndef USB_EP3_TX_BUF_SIZE
#define USB_EP3_TX_BUF_SIZE     8U
#endif
#define USB_EP3_TX_BUF_OFFSET   USB_EP3_RX_BUF_OFFSET + USB_EP3_RX_BUF_SIZE

#ifndef USB_EP4_RX_BUF_SIZE
#define USB_EP4_RX_BUF_SIZE     8U
#endif
#define USB_EP4_RX_BUF_OFFSET   USB_EP3_TX_BUF_OFFSET + USB_EP3_TX_BUF_SIZE

#ifndef USB_EP4_TX_BUF_SIZE
#define USB_EP4_TX_BUF_SIZE     8U
#endif
#define USB_EP4_TX_BUF_OFFSET   USB_EP4_RX_BUF_OFFSET + USB_EP4_RX_BUF_SIZE

#ifndef USB_EP5_RX_BUF_SIZE
#define USB_EP5_RX_BUF_SIZE     8U
#endif
#define USB_EP5_RX_BUF_OFFSET   USB_EP4_TX_BUF_OFFSET + USB_EP4_TX_BUF_SIZE

#ifndef USB_EP5_TX_BUF_SIZE
#define USB_EP5_TX_BUF_SIZE     8U
#endif
#define USB_EP5_TX_BUF_OFFSET   USB_EP5_RX_BUF_OFFSET + USB_EP5_RX_BUF_SIZE

#ifndef USB_EP6_RX_BUF_SIZE
#define USB_EP6_RX_BUF_SIZE     8U
#endif
#define USB_EP6_RX_BUF_OFFSET   USB_EP5_TX_BUF_OFFSET + USB_EP5_TX_BUF_SIZE

#ifndef USB_EP6_TX_BUF_SIZE
#define USB_EP6_TX_BUF_SIZE     8U
#endif
#define USB_EP6_TX_BUF_OFFSET   USB_EP6_RX_BUF_OFFSET + USB_EP6_RX_BUF_SIZE

#ifndef USB_EP7_RX_BUF_SIZE
#define USB_EP7_RX_BUF_SIZE     8U
#endif
#define USB_EP7_RX_BUF_OFFSET   USB_EP6_TX_BUF_OFFSET + USB_EP6_TX_BUF_SIZE

#ifndef USB_EP7_TX_BUF_SIZE
#define USB_EP7_TX_BUF_SIZE     8U
#endif
#define USB_EP7_TX_BUF_OFFSET   USB_EP7_RX_BUF_OFFSET + USB_EP7_RX_BUF_SIZE

#if ((USB_EP7_TX_BUF_OFFSET + USB_EP7_TX_BUF_SIZE) > 512U)
#error "The SUM of all Endpoint buffers sizes exceeds available dedicated RAM size (512 Bytes)."
#endif


// USBD Driver *****************************************************************

#define ARM_USBD_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(2,1)

// Driver Version
static const ARM_DRIVER_VERSION usbd_driver_version = { ARM_USBD_API_VERSION, ARM_USBD_DRV_VERSION };

// Driver Capabilities
static const ARM_USBD_CAPABILITIES usbd_driver_capabilities = {
  0U,   // VBUS Detection
  0U,   // Event VBUS On
  0U    // Event VBUS Off
};

#define EP_NUM(ep_addr)         ((ep_addr) & ARM_USB_ENDPOINT_NUMBER_MASK)
#define EP_ID(ep_addr)          ((EP_NUM(ep_addr) * 2U) + (((ep_addr) >> 7) & 1U))

typedef struct {                        // Endpoint structure definition
  uint8_t  *data;
  uint32_t  num;
  uint32_t  num_transferred_total;
  uint16_t  num_transferring;
  uint16_t  max_packet_size;
  uint8_t   active;
} ENDPOINT_t;

static ARM_USBD_SignalDeviceEvent_t   SignalDeviceEvent;
static ARM_USBD_SignalEndpointEvent_t SignalEndpointEvent;

static bool                hw_powered     = false;
static bool                hw_initialized = false;
static ARM_USBD_STATE      usbd_state;
static uint8_t             setup_packet[8];     // Setup packet data
static volatile uint8_t    setup_received;      // Setup packet received

