lhzloveyyj/FOC/stm32f103_FOC/电流环/.pack/Keil/STM32F1xx_DFP.2.3.0/RTE_Driver/USBD_STM32F10x.c
// Endpoint buffer address
#define EP_BUF_ADDR (sizeof(EP_BUF_DSCR)*8)
// Pointer to Endpoint descriptor table
static EP_BUF_DSCR        *pBUF_DSCR   = (EP_BUF_DSCR *)USB_PMA_ADDR;

static const uint16_t EP_buff_offset[16] = { USB_EP0_RX_BUF_OFFSET, USB_EP0_TX_BUF_OFFSET,
                                             USB_EP1_RX_BUF_OFFSET, USB_EP1_TX_BUF_OFFSET,
                                             USB_EP2_RX_BUF_OFFSET, USB_EP2_TX_BUF_OFFSET,
                                             USB_EP3_RX_BUF_OFFSET, USB_EP3_TX_BUF_OFFSET,
                                             USB_EP4_RX_BUF_OFFSET, USB_EP4_TX_BUF_OFFSET,
                                             USB_EP5_RX_BUF_OFFSET, USB_EP5_TX_BUF_OFFSET,
                                             USB_EP6_RX_BUF_OFFSET, USB_EP6_TX_BUF_OFFSET,
                                             USB_EP7_RX_BUF_OFFSET, USB_EP7_TX_BUF_OFFSET };

// Endpoints runtime information
static volatile ENDPOINT_t ep[(USBD_MAX_ENDPOINT_NUM + 1U) * 2U];

#define IN_EP_RESET(num)  (EPxREG(EP_NUM(num)) = (EPxREG(EP_NUM(num)) & (EP_MASK | EP_STAT_TX | EP_DTOG_TX)) | EP_CTR_TX | EP_CTR_RX)
#define OUT_EP_RESET(num) (EPxREG(EP_NUM(num)) = (EPxREG(EP_NUM(num)) & (EP_MASK | EP_STAT_RX | EP_DTOG_RX)) | EP_CTR_TX | EP_CTR_RX)

// Auxiliary functions
/**
  \fn          static void IN_EP_Status (uint8_t ep_num, uint32_t stat)
  \brief       Called to update Endpoint status
*/
void IN_EP_Status (uint8_t ep_num, uint32_t stat) {
  uint32_t num, val, ep_reg;

  num         =  ep_num & ARM_USB_ENDPOINT_NUMBER_MASK;
  stat       &=  EP_STAT_TX;
  ep_reg      =  EPxREG(num);
  val         = (ep_reg & EP_STAT_TX) ^ stat;
  val         = (ep_reg & ~EP_STAT_TX) | val;
  EPxREG(num) = (val & (EP_MASK | EP_STAT_TX)) | EP_CTR_TX | EP_CTR_RX;
}

/**
  \fn          static void OUT_EP_Status (uint8_t ep_num, uint32_t stat)
  \brief       Called to update Endpoint status
*/
void OUT_EP_Status (uint8_t ep_num, uint32_t stat) {
  uint32_t num, val, ep_reg;

  num         =  ep_num & ARM_USB_ENDPOINT_NUMBER_MASK;
  stat       &=  EP_STAT_RX;
  ep_reg      =  EPxREG(num);
  val         = (ep_reg & EP_STAT_RX) ^ stat;
  val         = (ep_reg & ~EP_STAT_RX) | val;
  EPxREG(num) = (val & (EP_MASK | EP_STAT_RX)) | EP_CTR_TX | EP_CTR_RX;
}

/**
  \fn          void USBD_EP_HW_Read (uint8_t ep_addr)
  \brief       Read data from USB Endpoint.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \return      number of data bytes read
*/
static void USBD_EP_HW_Read (uint8_t ep_addr) {
  volatile ENDPOINT_t *ptr_ep;
  uint32_t             cnt, i;
  __packed uint8_t    *ptr_dest_8;
  __packed uint16_t   *ptr_dest;
  volatile uint32_t   *ptr_src;
  uint8_t              ep_num;
  uint8_t              tmp_buf[4];

  ptr_ep = &ep[EP_ID(ep_addr)];
  ep_num = EP_NUM(ep_addr);

  cnt = (pBUF_DSCR + ep_num)->COUNT_RX & EP_COUNT_MASK;

  // Check for ZLP
  if (cnt          == 0U) { return; }

  // Check if buffer available
  if (ptr_ep->data == 0U) { return; }

  // Copy data from FIFO
  ptr_src  = (uint32_t *)(USB_PMA_ADDR + 2*((pBUF_DSCR + ep_num)->ADDR_RX));
  ptr_dest = (__packed uint16_t *)(ptr_ep->data + ptr_ep->num_transferred_total);

  i = cnt / 2U;
  while (i != 0U) {
    *ptr_dest++ = *ptr_src++;
    i--;
  }
  ptr_ep->num_transferred_total += cnt;

  // If data size is not equal n*2
  if ((cnt & 1U) != 0U) {
    ptr_dest_8 = (uint8_t *)(ptr_dest);
    *((__packed uint16_t *)tmp_buf) = *ptr_src;
    *ptr_dest_8 = tmp_buf[0];
  }

  if (cnt != ptr_ep->max_packet_size) { ptr_ep->num  = 0U;  }
  else                                { ptr_ep->num -= cnt; }
}

/**
  \fn          void USBD_EP_HW_Write (uint8_t ep_addr)
  \brief       Write data to Endpoint Buffer.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..7: Address
                - ep_addr.7:    Direction
*/
static void USBD_EP_HW_Write (uint8_t ep_addr) {
  volatile ENDPOINT_t *ptr_ep;
  uint8_t              ep_num;
  uint16_t             num, i;
  volatile uint32_t   *ptr_dest;
  __packed uint16_t   *ptr_src;

  ptr_ep = &ep[EP_ID(ep_addr)];
  ep_num = EP_NUM(ep_addr);

  if (ptr_ep->num > ptr_ep->max_packet_size) { num = ptr_ep->max_packet_size; }
  else                                       { num = ptr_ep->num;             }

  ptr_src  = (__packed uint16_t *)(ptr_ep->data + ptr_ep->num_transferred_total);
  ptr_dest = (uint32_t *)(USB_PMA_ADDR + 2*((pBUF_DSCR + ep_num)->ADDR_TX));

  ptr_ep->num_transferring  = num;
  ptr_ep->num              -= num;

  // Copy data to EP Buffer
  i = (num + 1U) >> 1;
  while (i != 0U) {
    *ptr_dest++ = *ptr_src++;
    i--;
  }

  (pBUF_DSCR + ep_num)->COUNT_TX = num;

  if ((EPxREG(ep_num) & EP_STAT_TX) != EP_TX_STALL) {
    IN_EP_Status(ep_addr, EP_TX_VALID);     // do not make EP valid if stalled
  }
}


/**
  \fn          static void USBD_Reset (uint8_t ep_addr)
  \brief       Called after usbd reset interrupt to reset configuration
*/
static void USBD_Reset (void) {

  ISTR = 0;                                 // Clear Interrupt Status

  CNTR = CNTR_CTRM | CNTR_RESETM | CNTR_SUSPM | CNTR_WKUPM | CNTR_ERRM | CNTR_PMAOVRM;


  // Reset global variables
  setup_received  = 0U;
  memset((void *)USB_PMA_ADDR, 0, EP_BUF_ADDR);
  memset((void *)&usbd_state,  0, sizeof(usbd_state));
  memset((void *)ep,           0, sizeof(ep));

  BTABLE = 0x00;                        // set BTABLE Address

  DADDR = DADDR_EF | 0;                 // Enable USB Default Address
}


// USBD Driver functions

/**
  \fn          ARM_DRIVER_VERSION USBD_GetVersion (void)
  \brief       Get driver version.
  \return      \ref ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION USBD_GetVersion (void) { return usbd_driver_version; }

/**
  \fn          ARM_USBD_CAPABILITIES USBD_GetCapabilities (void)
  \brief       Get driver capabilities.
  \return      \ref ARM_USBD_CAPABILITIES
*/
static ARM_USBD_CAPABILITIES USBD_GetCapabilities (void) { return usbd_driver_capabilities; }

/**
  \fn          int32_t USBD_Initialize (ARM_USBD_SignalDeviceEvent_t   cb_device_event,
                                        ARM_USBD_SignalEndpointEvent_t cb_endpoint_event)
  \brief       Initialize USB Device Interface.
  \param[in]   cb_device_event    Pointer to \ref ARM_USBD_SignalDeviceEvent
  \param[in]   cb_endpoint_event  Pointer to \ref ARM_USBD_SignalEndpointEvent
  \return      \ref execution_status
*/
static int32_t USBD_Initialize (ARM_USBD_SignalDeviceEvent_t   cb_device_event,
                                ARM_USBD_SignalEndpointEvent_t cb_endpoint_event) {

